contiki-os/contiki/cc26xxware/inc/hw_aux_tdc.h
// Field: [5]    START_POL
//
// Polarity of start signal.   Note! Must not be changed if STAT.STATE is not
// IDLE
// ENUMs:
// HIGH                 TDC starts when high level is detected
// LOW                  TDC starts when low level is detected
//
#define AUX_TDC_TRIGSRC_START_POL                                   0x00000020
#define AUX_TDC_TRIGSRC_START_POL_BITN                              5
#define AUX_TDC_TRIGSRC_START_POL_M                                 0x00000020
#define AUX_TDC_TRIGSRC_START_POL_S                                 5
#define AUX_TDC_TRIGSRC_START_POL_HIGH                              0x00000000
#define AUX_TDC_TRIGSRC_START_POL_LOW                               0x00000020

// Field: [4:0] START_SRC
//
// Selects the asynchronous start signal Note! Must not be changed if STAT.STATE
// is not IDLE
// ENUMs:
// AON_RTC_CH2          Selects AON_RTC_CH2
// AUX_COMPA            Selects AUX_COMPA
// AUX_COMPB            Selects AUX_COMPB
// ISRC_RESET           Selects ISRC_RESET
// TIMER0_EV            Selects TIMER0_EV
// TIMER1_EV            Selects TIMER1_EV
// SMPH_AUTOTAKE_DONE   Selects SMPH_AUTOTAKE_DONE
// ADC_DONE             Selects ADC_DONE
// ADC_FIFO_ALMOST_FULL Selects ADC_FIFO_ALMOST_FULL
// OBSMUX0              Selects OBSMUX0
// OBSMUX1              Selects OBSMUX1
// AON_SW               Selects AON_SW
// AON_PROG_WU          Selects AON_PROG_WU
// AUXIO0               Selects AUXIO0
// AUXIO1               Selects AUXIO1
// AUXIO2               Selects AUXIO2
// AUXIO3               Selects AUXIO3
// AUXIO4               Selects AUXIO4
// AUXIO5               Selects AUXIO5
// AUXIO6               Selects AUXIO6
// AUXIO7               Selects AUXIO7
// AUXIO8               Selects AUXIO8
// AUXIO9               Selects AUXIO9
// AUXIO10              Selects AUXIO10
// AUXIO11              Selects AUXIO11
// AUXIO12              Selects AUXIO12
// AUXIO13              Selects AUXIO13
// AUXIO14              Selects AUXIO14
// AUXIO15              Selects AUXIO15
// ACLK_REF             Selects ACLK_REF
// MCU_EV               Selects MCU_EV
// TDC_PRE              Selects TDC_PRE
//
#define AUX_TDC_TRIGSRC_START_SRC_M                                 0x0000001F
#define AUX_TDC_TRIGSRC_START_SRC_S                                 0
#define AUX_TDC_TRIGSRC_START_SRC_AON_RTC_CH2                       0x00000000
#define AUX_TDC_TRIGSRC_START_SRC_AUX_COMPA                         0x00000001
#define AUX_TDC_TRIGSRC_START_SRC_AUX_COMPB                         0x00000002
#define AUX_TDC_TRIGSRC_START_SRC_ISRC_RESET                        0x00000003
#define AUX_TDC_TRIGSRC_START_SRC_TIMER0_EV                         0x00000004
#define AUX_TDC_TRIGSRC_START_SRC_TIMER1_EV                         0x00000005
#define AUX_TDC_TRIGSRC_START_SRC_SMPH_AUTOTAKE_DONE                0x00000006
#define AUX_TDC_TRIGSRC_START_SRC_ADC_DONE                          0x00000007
#define AUX_TDC_TRIGSRC_START_SRC_ADC_FIFO_ALMOST_FULL              0x00000008
#define AUX_TDC_TRIGSRC_START_SRC_OBSMUX0                           0x00000009
#define AUX_TDC_TRIGSRC_START_SRC_OBSMUX1                           0x0000000A
#define AUX_TDC_TRIGSRC_START_SRC_AON_SW                            0x0000000B
#define AUX_TDC_TRIGSRC_START_SRC_AON_PROG_WU                       0x0000000C
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO0                            0x0000000D
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO1                            0x0000000E
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO2                            0x0000000F
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO3                            0x00000010
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO4                            0x00000011
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO5                            0x00000012
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO6                            0x00000013
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO7                            0x00000014
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO8                            0x00000015
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO9                            0x00000016
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO10                           0x00000017
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO11                           0x00000018
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO12                           0x00000019
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO13                           0x0000001A
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO14                           0x0000001B
#define AUX_TDC_TRIGSRC_START_SRC_AUXIO15                           0x0000001C
#define AUX_TDC_TRIGSRC_START_SRC_ACLK_REF                          0x0000001D
#define AUX_TDC_TRIGSRC_START_SRC_MCU_EV                            0x0000001E
#define AUX_TDC_TRIGSRC_START_SRC_TDC_PRE                           0x0000001F

//*****************************************************************************
//
// Register: AUX_TDC_O_TRIGCNT
//
//*****************************************************************************
// Field: [15:0] CNT
//
// Remaining number of stop events that will be ignored. Writing to this register
// updates the  value. The CNT will be loaded with the value of TRIGCNTLOAD.CNT
// at the start of every measurement.
//
// When the stop counter is enabled the first CNT-1 stop events is ignored
// after which the TDC will stop measurement on event number CNT
//
// Note! Must not be changed if STAT.STATE is not IDLE
#define AUX_TDC_TRIGCNT_CNT_M                                       0x0000FFFF
#define AUX_TDC_TRIGCNT_CNT_S                                       0

//*****************************************************************************
//
// Register: AUX_TDC_O_TRIGCNTLOAD
//
//*****************************************************************************
// Field: [15:0] CNT
//
// Selects the number of stop events that will be ignored by the TDC. This can be
// used to measure multiple periods of a clock signal. The value written to this
// field is loaded into the stop counter at the start of each measurement.
//
// Note! Both values 0 and 1 will make the TDC stop on the first event after the
// start event
//
// Note! Must not be changed if STAT.STATE is not IDLE
#define AUX_TDC_TRIGCNTLOAD_CNT_M                                   0x0000FFFF
#define AUX_TDC_TRIGCNTLOAD_CNT_S                                   0

//*****************************************************************************
//
// Register: AUX_TDC_O_TRIGCNTCFG
//
//*****************************************************************************
// Field: [0]    EN
//
// Stop counter enable
//
// 0: Stop counter is disabled
// 1: Stop counter is enabled
//
#define AUX_TDC_TRIGCNTCFG_EN                                       0x00000001
#define AUX_TDC_TRIGCNTCFG_EN_BITN                                  0
#define AUX_TDC_TRIGCNTCFG_EN_M                                     0x00000001
#define AUX_TDC_TRIGCNTCFG_EN_S                                     0

//*****************************************************************************
//
// Register: AUX_TDC_O_PRECTL
//
//*****************************************************************************
// Field: [7]    RESET_N
//
// Prescaler reset control
//
// 0: Prescaler is held in reset
// 1: Prescaler is not held in reset
//
#define AUX_TDC_PRECTL_RESET_N                                      0x00000080
#define AUX_TDC_PRECTL_RESET_N_BITN                                 7
#define AUX_TDC_PRECTL_RESET_N_M                                    0x00000080
#define AUX_TDC_PRECTL_RESET_N_S                                    7

// Field: [6]    RATIO
//
// Prescaler ratio. This controls how often an event is generated on the TDC_PRE
// line. After the prescaler is reset the event output TDC_PRE is 0.
// ENUMs:
// DIV16                Prescaler divides by 16. A rising edge on the output is
// generated for every 16 rising edges of the input (the output toggles on every 8th
// rising edge of the input).
// DIV64                Prescaler divides by 64. A rising edge on the output is
// generated for every 64 rising edges of the input (the output toggles on every
// 32th rising edge of the input). .
//
#define AUX_TDC_PRECTL_RATIO                                        0x00000040
#define AUX_TDC_PRECTL_RATIO_BITN                                   6
#define AUX_TDC_PRECTL_RATIO_M                                      0x00000040
#define AUX_TDC_PRECTL_RATIO_S                                      6
#define AUX_TDC_PRECTL_RATIO_DIV16                                  0x00000000
#define AUX_TDC_PRECTL_RATIO_DIV64                                  0x00000040

// Field: [4:0] SRC
//
// Selects event for prescaler to use as input
// Note! Only change when prescaler is in reset
// ENUMs:
// AON_RTC_CH2          Selects AON_RTC_CH2
// AUX_COMPA            Selects AUX_COMPA
// AUX_COMPB            Selects AUX_COMPB
// ISRC_RESET           Selects ISRC_RESET
// TIMER0_EV            Selects TIMER0_EV
// TIMER1_EV            Selects TIMER1_EV
// SMPH_AUTOTAKE_DONE   Selects SMPH_AUTOTAKE_DONE
// ADC_DONE             Selects ADC_DONE
// ADC_FIFO_ALMOST_FULL Selects ADC_FIFO_ALMOST_FULL
// OBSMUX0              Selects OBSMUX0
// OBSMUX1              Selects OBSMUX1
// AON_SW               Selects AON_SW
// AON_PROG_WU          Selects AON_PROG_WU
// AUXIO0               Selects AUXIO0
// AUXIO1               Selects AUXIO1
// AUXIO2               Selects AUXIO2
// AUXIO3               Selects AUXIO3
// AUXIO4               Selects AUXIO4
// AUXIO5               Selects AUXIO5
// AUXIO6               Selects AUXIO6
// AUXIO7               Selects AUXIO7
// AUXIO8               Selects AUXIO8
// AUXIO9               Selects AUXIO9
// AUXIO10              Selects AUXIO10
// AUXIO11              Selects AUXIO11
// AUXIO12              Selects AUXIO12
// AUXIO13              Selects AUXIO13
// AUXIO14              Selects AUXIO14
// AUXIO15              Selects AUXIO15
// ACLK_REF             Selects ACLK_REF
// MCU_EV               Selects MCU_EV
// ADC_IRQ              Selects ADC_IRQ
//
#define AUX_TDC_PRECTL_SRC_M                                        0x0000001F
#define AUX_TDC_PRECTL_SRC_S                                        0
#define AUX_TDC_PRECTL_SRC_AON_RTC_CH2                              0x00000000
#define AUX_TDC_PRECTL_SRC_AUX_COMPA                                0x00000001
#define AUX_TDC_PRECTL_SRC_AUX_COMPB                                0x00000002
#define AUX_TDC_PRECTL_SRC_ISRC_RESET                               0x00000003
#define AUX_TDC_PRECTL_SRC_TIMER0_EV                                0x00000004
#define AUX_TDC_PRECTL_SRC_TIMER1_EV                                0x00000005
#define AUX_TDC_PRECTL_SRC_SMPH_AUTOTAKE_DONE                       0x00000006
#define AUX_TDC_PRECTL_SRC_ADC_DONE                                 0x00000007
#define AUX_TDC_PRECTL_SRC_ADC_FIFO_ALMOST_FULL                     0x00000008
#define AUX_TDC_PRECTL_SRC_OBSMUX0                                  0x00000009
#define AUX_TDC_PRECTL_SRC_OBSMUX1                                  0x0000000A
#define AUX_TDC_PRECTL_SRC_AON_SW                                   0x0000000B
#define AUX_TDC_PRECTL_SRC_AON_PROG_WU                              0x0000000C
#define AUX_TDC_PRECTL_SRC_AUXIO0                                   0x0000000D
#define AUX_TDC_PRECTL_SRC_AUXIO1                                   0x0000000E
#define AUX_TDC_PRECTL_SRC_AUXIO2                                   0x0000000F
#define AUX_TDC_PRECTL_SRC_AUXIO3                                   0x00000010
#define AUX_TDC_PRECTL_SRC_AUXIO4                                   0x00000011
#define AUX_TDC_PRECTL_SRC_AUXIO5                                   0x00000012
#define AUX_TDC_PRECTL_SRC_AUXIO6                                   0x00000013
#define AUX_TDC_PRECTL_SRC_AUXIO7                                   0x00000014
#define AUX_TDC_PRECTL_SRC_AUXIO8                                   0x00000015
#define AUX_TDC_PRECTL_SRC_AUXIO9                                   0x00000016
#define AUX_TDC_PRECTL_SRC_AUXIO10                                  0x00000017
#define AUX_TDC_PRECTL_SRC_AUXIO11                                  0x00000018
#define AUX_TDC_PRECTL_SRC_AUXIO12                                  0x00000019
#define AUX_TDC_PRECTL_SRC_AUXIO13                                  0x0000001A
#define AUX_TDC_PRECTL_SRC_AUXIO14                                  0x0000001B
#define AUX_TDC_PRECTL_SRC_AUXIO15                                  0x0000001C
#define AUX_TDC_PRECTL_SRC_ACLK_REF                                 0x0000001D
#define AUX_TDC_PRECTL_SRC_MCU_EV                                   0x0000001E
#define AUX_TDC_PRECTL_SRC_ADC_IRQ                                  0x0000001F

//*****************************************************************************
//
// Register: AUX_TDC_O_PRECNT
//
//*****************************************************************************
// Field: [15:0] CNT
//
// Writing to this register will latch the contents of the 16 bit prescaler counter
// (The value written is don't care).
//
// Reading will return the latched value.
//
//
#define AUX_TDC_PRECNT_CNT_M                                        0x0000FFFF
#define AUX_TDC_PRECNT_CNT_S                                        0

#endif // __HW_AUX_TDC_H__
